const { SlashCommandBuilder } = require("@discordjs/builders");
const { MessageEmbed,MessageActionRow, MessageSelectMenu } = require('discord.js');
const replaceOnce = require('replace-once')

module.exports = {
      guildOnly: false, // サーバー専用コマンドかどうか
    adminGuildOnly: false, // 管理者用サーバー専用かどうか
    data: new SlashCommandBuilder() // スラッシュコマンド登録のため
        .setName("font")
        .setDescription("英語のフォントを別のフォントに変換する。")
      
	.addStringOption(option => option
		.setName('font')
			.setDescription('フォントを選択してください。')
			.setRequired(true)
			.addChoices(
        { name: '𝐓𝐞𝐱𝐭', value: '1' },
        { name: '𝑇𝑒𝑥𝑡', value: '2' },
        { name: '𝑻𝒆𝒙𝒕', value: '3' },
        { name: '𝗧𝗲𝘅𝘁', value: '4' },
        { name: '𝘛𝘦𝘹𝘵', value: '5' },
        { name: '𝙏𝙚𝙭𝙩', value: '6' },
        { name: '𝕋𝕖𝕩𝕥', value: '7' },
        { name: '🅣🅔🅧🅣', value: '8' },
        { name: 'Ⓣⓔⓧⓣ', value: '9' },
        { name: 'ᴛᴇxᴛ', value: '10' },
        { name: '🆃🅴🆇🆃', value: '11' },
        { name: '𝔗𝔢𝔵𝔱', value: '12' },
        { name: '𝕿𝖊𝖝𝖙', value: '125' },
        { name: '𝓣𝓮𝔁𝓽', value: '13' },
        { name: 'ʇxǝꓕ', value: '14' },
        { name: 'ꓕǝxʇ', value: '15' },
        { name: 'ՇєאՇ', value: '16' },
        { name: 'Tҽxƚ', value: '17' },
        { name: 'ȶɛӼȶ', value: '18' },
        { name: '𐌕𐌄𐋄𐌕', value: '19' },
        { name: '⒯⒠⒳⒯', value: '20' },
        { name: 'ᵗᵉˣᵗ', value: '21' },
        { name: 'ᏖᏋጀᏖ', value: '22' },
        { name: 'ｔｅｘｔ', value: '23' },
        { name: 'ㄒ乇乂ㄒ', value: '24' },
        ))

 	      .addStringOption(option => option.setName('text')
			.setDescription('文字を入力してください。')
			.setRequired(true)),
  
	async execute(i, client) { 
var text = i.options.getString('text')
    
    if(i.options.getString('font') === "1") {
var replace = ['𝐚','𝐛','𝐜','𝐝','𝐞','𝐟','𝐠','𝐡','𝐢','𝐣','𝐤','𝐥','𝐦','𝐧','𝐨','𝐩','𝐪','𝐫','𝐬','𝐭','𝐮','𝐯','𝐰','𝐱','𝐲','𝐳','𝐀','𝐁','𝐂','𝐃','𝐄','𝐅','𝐆','𝐇','𝐈','𝐉','𝐊','𝐋','𝐌','𝐍','𝐎','𝐏','𝐐','𝐑','𝐒','𝐓','𝐔','𝐕','𝐖','𝐗','𝐘','𝐙','𝟎','𝟏','𝟐','𝟑','𝟒','𝟓','𝟔','𝟕','𝟖','𝟗'] 
    }
   else if(i.options.getString('font') === "2") {
var replace = ['𝑎','𝑏','𝑐','𝑑','𝑒','𝑓','𝑔','ℎ','𝑖','𝑗','𝑘','𝑙','𝑚','𝑛','𝑜','𝑝','𝑞','𝑟','𝑠','𝑡','𝑢','𝑣','𝑤','𝑥','𝑦','𝑧','𝐴','𝐵','𝐶','𝐷','𝐸','𝐹','𝐺','𝐻','𝐼','𝐽','𝐾','𝐿','𝑀','𝑁','𝑂','𝑃','𝑄','𝑅','𝑆','𝑇','𝑈','𝑉','𝑊','𝑋','𝑌','𝑍','0','1','2','3','4','5','6','7','8','9'] 
    }
      else if(i.options.getString('font') === "3") {
var replace = ['𝒂','𝒃','𝒄','𝒅','𝒆','𝒇','𝒈','𝒉','𝒊','𝒋','𝒌','𝒍','𝒎','𝒏','𝒐','𝒑','𝒒','𝒓','𝒔','𝒕','𝒖','𝒗','𝒘','𝒙','𝒚','𝒛','𝑨','𝑩','𝑪','𝑫','𝑬','𝑭','𝑮','𝑯','𝑰','𝑱','𝑲','𝑳','𝑴','𝑵','𝑶','𝑷','𝑸','𝑹','𝑺','𝑻','𝑼','𝑽','𝑾','𝑿','𝒀','𝒁','𝟎','𝟏','𝟐','𝟑','𝟒','𝟓','𝟔','𝟕','𝟖','𝟗'] 
    }
       else if(i.options.getString('font') === "4") {
var replace = ['𝗮','𝗯','𝗰','𝗱','𝗲','𝗳','𝗴','𝗵','𝗶','𝗷','𝗸','𝗹','𝗺','𝗻','𝗼','𝗽','𝗾','𝗿','𝘀','𝘁','𝘂','𝘃','𝘄','𝘅','𝘆','𝘇','𝗔','𝗕','𝗖','𝗗','𝗘','𝗙','𝗚','𝗛','𝗜','𝗝','𝗞','𝗟','𝗠','𝗡','𝗢','𝗣','𝗤','𝗥','𝗦','𝗧','𝗨','𝗩','𝗪','𝗫','𝗬','𝗭','𝟬','𝟭','𝟮','𝟯','𝟰','𝟱','𝟲','𝟳','𝟴','𝟵'] 
    }
       else if(i.options.getString('font') === "5") {
var replace = ['𝘢','𝘣','𝘤','𝘥','𝘦','𝘧','𝘨','𝘩','𝘪','𝘫','𝘬','𝘭','𝘮','𝘯','𝘰','𝘱','𝘲','𝘳','𝘴','𝘵','𝘶','𝘷','𝘸','𝘹','𝘺','𝘻','𝘈','𝘉','𝘊','𝘋','𝘌','𝘍','𝘎','𝘏','𝘐','𝘑','𝘒','𝘓','𝘔','𝘕','𝘖','𝘗','𝘘','𝘙','𝘚','𝘛','𝘜','𝘝','𝘞','𝘟','𝘠','𝘡','0','1','2','3','4','5','6','7','8','9'] 
    }
       else if(i.options.getString('font') === "6") {
var replace = ['𝙖','𝙗','𝙘','𝙙','𝙚','𝙛','𝙜','𝙝','𝙞','𝙟','𝙠','𝙡','𝙢','𝙣','𝙤','𝙥','𝙦','𝙧','𝙨','𝙩','𝙪','𝙫','𝙬','𝙭','𝙮','𝙯','𝘼','𝘽','𝘾','𝘿','𝙀','𝙁','𝙂','𝙃','𝙄','𝙅','𝙆','𝙇','𝙈','𝙉','𝙊','𝙋','𝙌','𝙍','𝙎','𝙏','𝙐','𝙑','𝙒','𝙓','𝙔','𝙕','𝟬','𝟭','𝟮','𝟯','𝟰','𝟱','𝟲','𝟳','𝟴','𝟵'] 
    }
       else if(i.options.getString('font') === "7") {
var replace = ['𝕒','𝕓','𝕔','𝕕','𝕖','𝕗','𝕘','𝕙','𝕚','𝕛','𝕜','𝕝','𝕞','𝕟','𝕠','𝕡','𝕢','𝕣','𝕤','𝕥','𝕦','𝕧','𝕨','𝕩','𝕪','𝕫','𝔸','𝔹','ℂ','𝔻','𝔼','𝔽','𝔾','ℍ','𝕀','𝕁','𝕂','𝕃','𝕄','ℕ','𝕆','ℙ','ℚ','ℝ','𝕊','𝕋','𝕌','𝕍','𝕎','𝕏','𝕐','ℤ','𝟘','𝟙','𝟚','𝟛','𝟜','𝟝','𝟞','𝟟','𝟠','𝟡'] 
    }
       else if(i.options.getString('font') === "8") {
var replace = ['🅐','🅑','🅒','🅓','🅔','🅕','🅖','🅗','🅘','🅙','🅚','🅛','🅜','🅝','🅞','🅟','🅠','🅡','🅢','🅣','🅤','🅥','🅦','🅧','🅨','🅩','🅐','🅑','🅒','🅓','🅔','🅕','🅖','🅗','🅘','🅙','🅚','🅛','🅜','🅝','🅞','🅟','🅠','🅡','🅢','🅣','🅤','🅥','🅦','🅧','🅨','🅩','⓿','❶','❷','❸','❹','❺','❻','❼','❽','❾'] 
    }
       else if(i.options.getString('font') === "9") {
var replace = ['ⓐ','ⓑ','ⓒ','ⓓ','ⓔ','ⓕ','ⓖ','ⓗ','ⓘ','ⓙ','ⓚ','ⓛ','ⓜ','ⓝ','ⓞ','ⓟ','ⓠ','ⓡ','ⓢ','ⓣ','ⓤ','ⓥ','ⓦ','ⓧ','ⓨ','ⓩ','Ⓐ','Ⓑ','Ⓒ','Ⓓ','Ⓔ','Ⓕ','Ⓖ','Ⓗ','Ⓘ','Ⓙ','Ⓚ','Ⓛ','Ⓜ','Ⓝ','Ⓞ','Ⓟ','Ⓠ','Ⓡ','Ⓢ','Ⓣ','Ⓤ','Ⓥ','Ⓦ','Ⓧ','Ⓨ','Ⓩ','⓪','①','②','③','④','⑤','⑥','⑦','⑧','⑨'] 
    }
       else if(i.options.getString('font') === "10") {
var replace = ['ᴀ','ʙ','ᴄ','ᴅ','ᴇ','ғ','ɢ','ʜ','ɪ','ᴊ','ᴋ','ʟ','ᴍ','ɴ','ᴏ','ᴘ','ǫ','ʀ','s','ᴛ','ᴜ','ᴠ','ᴡ','x','ʏ','ᴢ','ᴀ','ʙ','ᴄ','ᴅ','ᴇ','ғ','ɢ','ʜ','ɪ','ᴊ','ᴋ','ʟ','ᴍ','ɴ','ᴏ','ᴘ','ǫ','ʀ','s','ᴛ','ᴜ','ᴠ','ᴡ','x','ʏ','ᴢ','0','1','2','3','4','5','6','7','8','9'] 
    }
       else if(i.options.getString('font') === "11") {
var replace = ['🅰','🅱','🅲','🅳','🅴','🅵','🅶','🅷','🅸','🅹','🅺','🅻','🅼','🅽','🅾','🅿','🆀','🆁','🆂','🆃','🆄','🆅','🆆','🆇','🆈','🆉','🅰','🅱','🅲','🅳','🅴','🅵','🅶','🅷','🅸','🅹','🅺','🅻','🅼','🅽','🅾','🅿','🆀','🆁','🆂','🆃','🆄','🆅','🆆','🆇','🆈','🆉','0⃣','1⃣','2⃣','3⃣','4⃣','5⃣','6⃣','7⃣','8⃣','9⃣'] 
    }
       else if(i.options.getString('font') === "12") {
var replace = ['𝔞','𝔟','𝔠','𝔡','𝔢','𝔣','𝔤','𝔥','𝔦','𝔧','𝔨','𝔩','𝔪','𝔫','𝔬','𝔭','𝔮','𝔯','𝔰','𝔱','𝔲','𝔳','𝔴','𝔵','𝔶','𝔷','𝔄','𝔅','ℭ','𝔇','𝔈','𝔉','𝔊','ℌ','ℑ','𝔍','𝔎','𝔏','𝔐','𝔑','𝔒','𝔓','𝔔','ℜ','𝔖','𝔗','𝔘','𝔙','𝔚','𝔛','𝔜','ℨ','0','1','2','3','4','5','6','7','8','9'] 
    }
        else if(i.options.getString('font') === "125") {
var replace = ['𝖆','𝖇','𝖈','𝖉','𝖊','𝖋','𝖌','𝖍','𝖎','𝖏','𝖐','𝖑','𝖒','𝖓','𝖔','𝖕','𝖖','𝖗','𝖘','𝖙','𝖚','𝖛','𝖜','𝖝','𝖞','𝖟','𝕬','𝕭','𝕮','𝕯','𝕰','𝕱','𝕲','𝕳','𝕴','𝕵','𝕶','𝕷','𝕸','𝕹','𝕺','𝕻','𝕼','𝕽','𝕾','𝕿','𝖀','𝖁','𝖂','𝖃','𝖄','𝖅','0','1','2','3','4','5','6','7','8','9'] 
    }
       else if(i.options.getString('font') === "13") {
var replace = ['𝓪','𝓫','𝓬','𝓭','𝓮','𝓯','𝓰','𝓱','𝓲','𝓳','𝓴','𝓵','𝓶','𝓷','𝓸','𝓹','𝓺','𝓻','𝓼','𝓽','𝓾','𝓿','𝔀','𝔁','𝔂','𝔃','𝓐','𝓑','𝓒','𝓓','𝓔','𝓕','𝓖','𝓗','𝓘','𝓙','𝓚','𝓛','𝓜','𝓝','𝓞','𝓟','𝓠','𝓡','𝓢','𝓣','𝓤','𝓥','𝓦','𝓧','𝓨','𝓩','0','1','2','3','4','5','6','7','8','9'] 
    }
       else if(i.options.getString('font') === "14") {
var replace = ['ɐ','q','ɔ','p','ǝ','ɟ','ƃ','ɥ','ı̣','ɾ̣','ʞ','ן','ɯ','u','o','d','b','ɹ','s','ʇ','n','ʌ','ʍ','x','ʎ','z','Ɐ','ꓭ','Ɔ','ꓷ','Ǝ','Ⅎ','ꓨ','H','I','ſ','ꓘ','ꓶ','W','N','O','Ԁ','Ò','ꓤ','S','ꓕ','ꓵ','ꓥ','M','X','⅄','Z','0','1','2','3','4','5','6','7','8','9'] 
    }
       else if(i.options.getString('font') === "15") {
var replace = ['ɐ','q','ɔ','p','ǝ','ɟ','ƃ','ɥ','ı̣','ɾ̣','ʞ','ן','ɯ','u','o','d','b','ɹ','s','ʇ','n','ʌ','ʍ','x','ʎ','z','Ɐ','ꓭ','Ɔ','ꓷ','Ǝ','Ⅎ','ꓨ','H','I','ſ','ꓘ','ꓶ','W','N','O','Ԁ','Ò','ꓤ','S','ꓕ','ꓵ','ꓥ','M','X','⅄','Z','0','1','2','3','4','5','6','7','8','9']
    }
           else if(i.options.getString('font') === "16") {
var replace = ['ค','๒','ς','๔','є','Ŧ','ﻮ','ђ','เ','ן','к','ɭ','๓','ภ','๏','ק','ợ','г','ร','Շ','ย','ש','ฬ','א','ץ','չ','ค','๒','ς','๔','є','Ŧ','ﻮ','ђ','เ','ן','к','ɭ','๓','ภ','๏','ק','ợ','г','ร','Շ','ย','ש','ฬ','א','ץ','չ','0','1','2','3','4','5','6','7','8','9'] 
    }
       else if(i.options.getString('font') === "17") {
var replace = ['α','Ⴆ','ƈ','ԃ','ҽ','ϝ','ɠ','ԋ','ι','ʝ','ƙ','ʅ','ɱ','ɳ','σ','ρ','ϙ','ɾ','ʂ','ƚ','υ','ʋ','ɯ','x','ყ','ȥ','A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z','0','1','2','3','4','5','6','7','8','9'] 
    }
       else if(i.options.getString('font') === "18") {
var replace = ['ǟ','ɮ','ƈ','ɖ','ɛ','ʄ','ɢ','ɦ','ɨ','ʝ','ӄ','ʟ','ʍ','ռ','օ','ք','զ','ʀ','ֆ','ȶ','ʊ','ʋ','ա','Ӽ','ʏ','ʐ','ǟ','ɮ','ƈ','ɖ','ɛ','ʄ','ɢ','ɦ','ɨ','ʝ','ӄ','ʟ','ʍ','ռ','օ','ք','զ','ʀ','ֆ','ȶ','ʊ','ʋ','ա','Ӽ','ʏ','ʐ','0','1','2','3','4','5','6','7','8','9']
    }
       else if(i.options.getString('font') === "19") {
var replace = ['𐌀','𐌁','𐌂','𐌃','𐌄','𐌅','Ᏽ','𐋅','𐌉','Ꮭ','𐌊','𐌋','𐌌','𐌍','Ꝋ','𐌐','𐌒','𐌓','𐌔','𐌕','𐌵','ᕓ','Ꮤ','𐋄','𐌙','Ɀ','𐌀','𐌁','𐌂','𐌃','𐌄','𐌅','Ᏽ','𐋅','𐌉','Ꮭ','𐌊','𐌋','𐌌','𐌍','Ꝋ','𐌐','𐌒','𐌓','𐌔','𐌕','𐌵','ᕓ','Ꮤ','𐋄','𐌙','Ɀ','Ꝋ','ᛑ','ᘖ','ᙣ','ᔦ','ᔕ','ᑳ','ᒣ','ზ','ᖗ'] 
    }
       else if(i.options.getString('font') === "20") {
var replace = ['⒜','⒝','⒞','⒟','⒠','⒡','⒢','⒣','⒤','⒥','⒦','⒧','⒨','⒩','⒪','⒫','⒬','⒭','⒮','⒯','⒰','⒱','⒲','⒳','⒴','⒵','⒜','⒝','⒞','⒟','⒠','⒡','⒢','⒣','⒤','⒥','⒦','⒧','⒨','⒩','⒪','⒫','⒬','⒭','⒮','⒯','⒰','⒱','⒲','⒳','⒴','⒵','0','⑴','⑵','⑶','⑷','⑸','⑹','⑺','⑻','⑼'] 
    }
       else if(i.options.getString('font') === "21") {
var replace = ['ᵃ','ᵇ','ᶜ','ᵈ','ᵉ','ᶠ','ᵍ','ʰ','ⁱ','ʲ','ᵏ','ˡ','ᵐ','ⁿ','ᵒ','ᵖ','q','ʳ','ˢ','ᵗ','ᵘ','ᵛ','ʷ','ˣ','ʸ','ᶻ','ᴬ','ᴮ','ᶜ','ᴰ','ᴱ','ᶠ','ᴳ','ᴴ','ᴵ','ᴶ','ᴷ','ᴸ','ᴹ','ᴺ','ᴼ','ᴾ','Q','ᴿ','ˢ','ᵀ','ᵁ','ⱽ','ᵂ','ˣ','ʸ','ᶻ','⁰','¹','²','³','⁴','⁵','⁶','⁷','⁸','⁹']
    }
           else if(i.options.getString('font') === "22") {
var replace = ['Ꮧ','Ᏸ','ፈ','Ꮄ','Ꮛ','Ꭶ','Ꮆ','Ꮒ','Ꭵ','Ꮰ','Ꮶ','Ꮭ','Ꮇ','Ꮑ','Ꭷ','Ꭾ','Ꭴ','Ꮢ','Ꮥ','Ꮦ','Ꮼ','Ꮙ','Ꮗ','ጀ','Ꭹ','ፚ','Ꮧ','Ᏸ','ፈ','Ꮄ','Ꮛ','Ꭶ','Ꮆ','Ꮒ','Ꭵ','Ꮰ','Ꮶ','Ꮭ','Ꮇ','Ꮑ','Ꭷ','Ꭾ','Ꭴ','Ꮢ','Ꮥ','Ꮦ','Ꮼ','Ꮙ','Ꮗ','ጀ','Ꭹ','ፚ','0','1','2','3','4','5','6','7','8','9'] 
    }
       else if(i.options.getString('font') === "23") {
var replace = ['ａ','ｂ','ｃ','ｄ','ｅ','ｆ','ｇ','ｈ','ｉ','ｊ','ｋ','ｌ','ｍ','ｎ','ｏ','ｐ','ｑ','ｒ','ｓ','ｔ','ｕ','ｖ','ｗ','ｘ','ｙ','ｚ','Ａ','Ｂ','Ｃ','Ｄ','Ｅ','Ｆ','Ｇ','Ｈ','Ｉ','Ｊ','Ｋ','Ｌ','Ｍ','Ｎ','Ｏ','Ｐ','Ｑ','Ｒ','Ｓ','Ｔ','Ｕ','Ｖ','Ｗ','Ｘ','Ｙ','Ｚ','０','１','２','３','４','５','６','７','８','９'] 
    }
       else if(i.options.getString('font') === "24") {
var replace = ['卂','乃','匚','ᗪ','乇','千','Ꮆ','卄','丨','ﾌ','Ҝ','ㄥ','爪','几','ㄖ','卩','Ɋ','尺','丂','ㄒ','ㄩ','ᐯ','山','乂','ㄚ','乙','卂','乃','匚','ᗪ','乇','千','Ꮆ','卄','丨','ﾌ','Ҝ','ㄥ','爪','几','ㄖ','卩','Ɋ','尺','丂','ㄒ','ㄩ','ᐯ','山','乂','ㄚ','乙','0','1','2','3','4','5','6','7','8','9']
    }
    
var find = ['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z','A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z','0','1','2','3','4','5','6','7','8','9']
var context = replaceOnce(text, find, replace, 'g')
    
if (i.options.getString('font') === "15") {
i.reply({content: context.split('').reverse().join('')})
}
       else {
  i.reply({content: context})
        }
    }
}